#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/wallet-dev-gh-actions/runs/run-3EGckCMxzv4hgCYe

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.aws_ami.selected: Reading...
data.aws_vpc.default: Reading...
data.aws_ami.selected: Read complete after 0s [id=ami-0f8dfcd948b1c8415]
data.aws_vpc.default: Read complete after 0s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
module.instance_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a960e616202d9c64]
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b6c25bbd8febe0f]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221108043128581700000003/5823dca6772c4fd2]
data.aws_subnet_ids.all: Read complete after 0s [id=vpc-ff49b386]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2253631981]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/wallet-dev-stack/1b0a018590a090a4]
module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3766356702]
module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-866015406]
module.instance_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3548996112]
aws_launch_template.this: Refreshing state... [id=lt-0e752e1c0b3046af2]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/wallet-dev-stack/1b0a018590a090a4/a292680e4413c37c]
aws_cloudformation_stack.this: Refreshing state... [id=arn:aws:cloudformation:eu-west-1:277142373668:stack/wallet-dev-stack/e90caba0-5f1f-11ed-8309-02644832459f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-03b6c25bbd8febe0f"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "SSH"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (1 unchanged element hidden)
        ]
        name                   = "wallet-dev-stack_lb_sg-20221108044132908700000002"
        tags                   = {
            "Name" = "wallet-dev-stack_lb_sg"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be updated in-place
  ~ resource "aws_cloudformation_stack" "this" {
        id                 = "arn:aws:cloudformation:eu-west-1:277142373668:stack/wallet-dev-stack/e90caba0-5f1f-11ed-8309-02644832459f"
        name               = "wallet-dev-stack"
        tags               = {}
      ~ template_body      = <<-EOT
            Resources:
              ASG:
                Type: AWS::AutoScaling::AutoScalingGroup
                Properties:
                  AutoScalingGroupName: "wallet-dev-stack"
                  HealthCheckGracePeriod: 300
                  DesiredCapacity: 1
                  MaxSize: 1
                  MinSize: 1
                  VPCZoneIdentifier: ["subnet-51d5e237","subnet-5315131b","subnet-6d0f7f37"]
                  TargetGroupARNs: ["arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221108043128581700000003/5823dca6772c4fd2"]
                  Tags: []
                  HealthCheckType: EC2
            
                  MixedInstancesPolicy:
                    InstancesDistribution:
                      OnDemandBaseCapacity: 0
                      OnDemandPercentageAboveBaseCapacity: 0
                      SpotAllocationStrategy: capacity-optimized
                    LaunchTemplate:
                      LaunchTemplateSpecification:
                        LaunchTemplateName: "wallet-dev-stack20221108044134656600000003"
                        Version: "3"
                      Overrides: []
            
                UpdatePolicy:
                # Ignore differences in group size properties caused by scheduled actions
                  AutoScalingScheduledAction:
                    IgnoreUnmodifiedGroupSizeProperties: true
                  AutoScalingRollingUpdate:
                    MinSuccessfulInstancesPercent: 50
                    PauseTime: PT10M
                    SuspendProcesses:
                      - HealthCheck
                      - ReplaceUnhealthy
                      - AZRebalance
                      - AlarmNotification
                      - ScheduledActions
                    WaitOnResourceSignals: true
            
                DeletionPolicy: Delete
        EOT -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0e752e1c0b3046af2"
      ~ image_id                = "ami-0fe9414bb0a413eaf" -> "ami-0f8dfcd948b1c8415"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "wallet-dev-stack20221108044134656600000003"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-03b6c25bbd8febe0f"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 1 to add, 2 to change, 0 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*